In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(
   ...:     np.random.randn(5, 3),
   ...:     index=["a", "c", "e", "f", "h"],
   ...:     columns=["one", "two", "three"],
   ...: )

df

        one       two     three
a  0.451126  1.669191 -0.122225
c -2.438164  0.842862  0.219011
e  0.086412  1.574959 -1.750693
f -0.290275  0.876510 -1.184469
h  1.396183 -1.381900 -0.980313

In [4]:
df["four"] = "bar"

In [5]:
df["five"] = df["one"] > 0

In [6]:
df

        one       two     three four   five
a  0.451126  1.669191 -0.122225  bar   True
c -2.438164  0.842862  0.219011  bar  False
e  0.086412  1.574959 -1.750693  bar   True
f -0.290275  0.876510 -1.184469  bar  False
h  1.396183 -1.381900 -0.980313  bar   True

In [8]:
df2 = df.reindex(["a", "b", "c", "d", "e", "f", "g", "h"])
df2

        one       two     three four   five
a  0.451126  1.669191 -0.122225  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -2.438164  0.842862  0.219011  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.086412  1.574959 -1.750693  bar   True
f -0.290275  0.876510 -1.184469  bar  False
g       NaN       NaN       NaN  NaN    NaN
h  1.396183 -1.381900 -0.980313  bar   True

In [9]:
df2["one"]

a    0.451126
b         NaN
c   -2.438164
d         NaN
e    0.086412
f   -0.290275
g         NaN
h    1.396183
Name: one, dtype: float64

In [10]:
pd.isna(df2["one"])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [11]:
df2["four"].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: four, dtype: bool

In [12]:
df2.isna()

     one    two  three   four   five
a  False  False  False  False  False
b   True   True   True   True   True
c  False  False  False  False  False
d   True   True   True   True   True
e  False  False  False  False  False
f  False  False  False  False  False
g   True   True   True   True   True
h  False  False  False  False  False

In [13]:
None == None

True

In [14]:
np.nan == np.nan

False

In [15]:
df2["one"] == np.nan

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h    False
Name: one, dtype: bool